<?php
session_start();
if ($_SESSION['authorized']<>1) {
    header("Location: login");
    exit;
}
header('Content-Type: text/html; charset=utf-8');
//require_once "pdf/dompdf/autoload.inc.php";
require_once("pdf/dompdf/dompdf_config.inc.php");
//use Dompdf\Dompdf;
$dompdf = new Dompdf();

$html = '
<html><meta http-equiv="content-type" content="text/html; charset=utf-8" /><body>
<style type="text/css">
    .tab TD {
        border-bottom: 1px solid #000;
        background: #D0E0F2;
        font-family: DejaVu Sans;
        font-size: 8;
    }
    .tab TR {
        height: 10px;
    }
    .head p {
    line-height: 20%;
    font-size: 6;
    }
</style>
<table class="head" style="width: 700px">
    <tbody>
    <tr>
        <td>
            <p>Страховик________________________</p>
            <p>тел./факс _____________________________</p>
            <p>Ліцензія № _____________ серія _______</p>
        </td>

        <td colspan="2">
            <h5 style="text-align: right;">примірник Застрахованої особи</h5>
        </td>
    </tr>
    <tr>
        <td colspan="3"><br />
            <h3 style="text-align: center;">Страхове свідоцтво</h3>
            <p style="text-align: center;">добровільного медичного страхування</p>
            <h4 style="text-align: right">Серія____    №__________</h4>
        </td>
    </tr>
    </tbody>
</table>


<table class="tab" style="width: 700px;">
    <tbody>
    <tr>
        <td colspan="3" rowspan="3">
            <p>Страхувальник</p>
        </td>
        <td colspan="2">П.І.Б.:</td>
        <td colspan="13">222</td>
    </tr>
    <tr>
        <td colspan="2">Адреса:</td>
        <td colspan="13">222</td>
    </tr>
    <tr>
        <td colspan="2">дата народження:</td>
        <td colspan="13">222</td>
    </tr>
    <tr>
        <td colspan="3" rowspan="2"><p>Застрахована особа</p></td>
        <td colspan="2">П.І.Б.:</td>
        <td colspan="13">222</td>
    </tr>
    <tr>
        <td colspan="2">Адреса:</td>
        <td colspan="4">222</td>
        <td colspan="3">дата народження:</td>
        <td colspan="6">222</td>
    </tr>
    <tr>
        <td colspan="3" rowspan="2">
            <p>Вигодонабувач</p>
        </td>
        <td colspan="2">Медичний заклад:</td>
        <td colspan="13">222</td>
    </tr>
    <tr>
        <td colspan="2">Адреса:</td>
        <td colspan="13">222</td>
    </tr>
    <tr>
        <td colspan="3">
            <p>Програма добровільного медичного страхування (ДМС)</p>
        </td>
        <td colspan="4">
            <p>YJP56737</p>
        </td>
        <td colspan="2">
            <p>Строк дії страхового свідоцтва</p>
        </td>
        <td colspan="4">
            <p>5 lysd</p>
        </td>
        <td colspan="2">
            <p>Термін сплати страхового платежу</p>
        </td>
        <td colspan="3">
            <p>12121212</p>
        </td>
    </tr>
    <tr><td colspan="18"></td></tr>
    <tr>
        <td>
            <p>Код випадку</p>
        </td>
        <td colspan="13">
            <p><em>Страховий ризик</em></p>
        </td>
        <td colspan="4">
            <p>Сума, грн.</p>
        </td>
    </tr>
    <tr>
        <td>
            <p>5555</p>
        </td>
        <td colspan="13">
            <p>666666</p>
        </td>
        <td colspan="4">
            <p>7897979</p>
        </td>
    </tr>
    <tr>
        <td colspan="14">
            <p>Всього</p>
        </td>
        <td colspan="4">
            <p></p>
        </td>
    </tr>
    <tr>
        <td colspan="2">
            <p>Страховий тариф, %</p>
        </td>
        <td colspan="4">
            <p></p>
        </td>
        <td colspan="3">
            <p>Страхова сума, грн.</p>
        </td>
        <td colspan="4">
            <p></p>
        </td>
        <td colspan="2">
            <p>Страховий платіж, грн.</p>
        </td>
        <td colspan="3">
            <p></p>
        </td>
    </tr>
    </tbody>
</table>
<br/>
<br/>
<p style="font-size: 8">Застрахована особа за цим свідоцтвом обслуговується тільки в _______________ за зазначеною Програмою ДМС</p>
<p>&nbsp;</p>
<p>&nbsp;&nbsp;</p>
<table style="width: 600px; font-size: 8">
    <tbody>
    <tr>
        <td>
            <p>&nbsp;</p>
        </td>
        <td colspan="4">
            <p>&nbsp;З умовами страхування на зворотній стороні ознайомлений (а)</p>
        </td>
        <td colspan="3">
            <p style="background: #9eb4bc">&nbsp;______________</p>
        </td>
        <td colspan="2">
            <p>&nbsp;</p>
        </td>
    </tr>
    <tr>
        <td colspan="4">
            <p>Страхувальник</p>
            <p>&ldquo;______&rdquo;____________20_р.</p>
        </td>
        <td colspan="2">
            <p>&nbsp;</p>
        </td>
        <td colspan="4">
            <p>Від Страховика</p>
            <p>&nbsp; &ldquo;______&rdquo;____________20__р.</p>
        </td>
    </tr>
    </tbody>
</table>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>

<div style="width: 700px; font-family: Arial; font-size: 8">
<h4>Умови добровільного медичного страхування</h4>
<h4>Даний договір укладено відповідно до Правил добровільного медичного страхування №____,</h4>
<h4>затверджених ________ 20_ р. та Програми короткострокового медичного страхування</h4>
<p>&nbsp;</p>
<ol>
    <li><strong><u>Предметом договору страхування</u></strong> є майнові&nbsp; інтереси, що не суперечать законодавству України,&nbsp; пов\'язані&nbsp; зі здоров\'ям&nbsp; <em>Застрахованої особи</em>.</li>
    <li><strong><u>Страховий випадок</u></strong> - звернення Застрахованої особи під час дії договору до медичного закладу, що вказаний у даному Договоруі у зв\'язку з гострим захворюванням, загостренням хронічного захворювання або травмою, отруєнням, іншими наслідками нещасного випадку, з метою одержання медичної допомоги та медичних послуг у межах переліку страхових випадків (наведених у Додатку 1 до Договору)&nbsp; та в обсязі лімітів відповідальності страховика відповідно до Програми короткострокового медичного страхування</li>
    <li>Медична допомога застрахованій особі надається тільки на базі медичного закладу вказаного в графі <em><u>Вигодонабувач</u></em> даного договору.</li>
    <li><strong><u>Права та обов&rsquo;язки сторін</u></strong> <em>Страхувальник </em><em>має право:</em>
        <ul>
            <li>У разі настання страхового випадку, на оплату вартості отриманої медичної допомоги, медичних послуг в межах страхової суми;</li>
            <li>Вимагати внесення змін до Договору страхування та/або сплати додаткового страхового платежу в разі отримання інформації від <em>Страхувальника</em> про обставини, які стали причиною збільшення страхового ризику;</li>
            <li>На дострокове припинення Договору страхування згідно з умовами пункту 7.8 вищевказаних Правил.</li>
        </ul>
    </li>
</ol>
<p><em>Страхувальник </em>&nbsp;зобов\'язаний:</p>
<ul>
    <li>Сплачувати страховий платіж у розмірі і в строки, що обумовлені Договором страхування;</li>
    <li>Надати інформацію <em>Страховикові </em>про всі відомі йому обставини, що мають істотне значення для оцінки страхового ризику, і надалі інформувати його про будь-яку зміну страхового ризику та виконувати інші статті 21 Закону України Про страхування.</li>
</ul>
<p><em>Страховик має право:</em></p>
<ul>
    <li>При наявності сумнівів у підставах для виплати страхової суми відстрочити її на п&rsquo;ятнадцять днів до отримання підтвердження цих підстав.</li>
</ul>
<p><em>Страховик зобов\'язаний:</em></p>
<ul>
    <li>Ознайомити <em>Застраховану особу </em>з умовами та Правилами страхування;</li>
    <li>При настанні страхового випадку здійснити виплату згідно розділу 10 цих Правил та дотримання відповідних пунктів статті 20 Закону України Про страхування.</li>
</ul>
<ol start="5">
    <li><strong><u>Порядок і умови виплати страхового відшкодування.</u></strong> Виплата страхового відшкодування здійснюється Страховиком шляхом оплати медичному закладу (вигодонабувачу) вартості наданих ним Застрахованій особі медичних послуг та медичної допомоги, передбачених Програмою короткострокового медичного страхування по проекту &laquo;Монополіс&raquo; в межах лімітів відповідальності страховика, якщо інше не передбачено Договором страхування.</li>
    <li><strong><u>Відмова у страховій виплаті.</u></strong> Страховик має право відмовити у здійснені страхових виплат відповідно до умов, визначених статтею 26 Закону України &laquo;Про страхування&raquo;.</li>
</ol>
<p><strong><u>Відповідальність страховика</u></strong> відповідно до умов Правил страхування.</p>
<p><strong><u>Умови припинення Договору страхування</u></strong><strong>: </strong>Дія договору страхування припиняється за згодою <em>Сторін</em>, а також: При закінченні строку дії Договору страхування; При виконанні Страховиком зобов\'язань у повному обсязі; В інших випадках, передбачених законодавством України.</p>
</div>
</body></html>';

//echo $html;
$dompdf->load_html($html);
$dompdf->render();
$output = $dompdf->output();
file_put_contents('Brochure1.pdf', $output);
$dompdf->stream("hello.pdf",array('Attachment'=>0));
?>